# Recap from last lesson

In [1]:
my_list = [1, 4, 6, 7, 9, 9, 9]

In [3]:
def divides_by_three(num):
    if num % 3 == 0:
        return True
    else:
        return False

In [4]:
x = 15
divides_by_three(x)

True

In [5]:
for x in my_list:
    if divides_by_three(x):
        print(x)

6
9
9
9

In [6]:
for x in my_list:
    if divides_by_three(x) and x%2==0:
        print(x)

6

In [7]:
for y in my_list:
    if divides_by_three(y) or y%2==0:
        print(y)

4
6
9
9
9

# Let's solve a problem together
### My approach 
1) understand the problem using a simple example
2) define the "what needs to happen", use also less simple and non trivial examples
3) write it into pseudocode - i usually start with input and the needed output and then start going back
4) start writing code

### Problem from Lists tutorial:

We're using lists to record people who attended our party and what order they arrived in. For example, the following list represents a party with 7 guests, in which Adela showed up first and Ford was the last to arrive:

party_attendees = ['Adela', 'Fleda', 'Owen', 'May', 'Mona', 'Gilbert', 'Ford']

A guest is considered 'fashionably late' if they arrived after at least half of the party's guests. However, they must not be the very last guest (that's taking it too far). In the above example, Mona and Gilbert are the only guests who were fashionably late.

Complete the function below which takes a list of party attendees as well as a person, and tells us whether that person is fashionably late.

In [15]:
def fashionably_late(arrivals, name):
    """Given an ordered list of arrivals to the party and a name, return whether the guest with that
    name was fashionably late.
    """
    pass

In [17]:
a1 = ['Adela', 'Fleda', 'Owen', 'May', 'Mona', 'Gilbert', 'Ford'] #mona + gilbert
a2 = ['George', 'Paul', 'Ringo', 'John'] #answer: rino

In [19]:
len(a1)

7

In [21]:
a1[len(a1)-1] #last person who isn't fashionably late
a1[-1]

'Ford'

In [23]:
len(a1)/2 #greater than this is an index for fashionably late

3.5

In [25]:
len(a2)/2

2.0

In [27]:
a1.index('Mona')

4

In [29]:
'Mona' != a1[-1] and a1.index('Mona') >= len(a1)/2

True

In [31]:
def fashionably_late(arrivals, name):
    """Given an ordered list of arrivals to the party and a name, return whether the guest with that
    name was fashionably late.
    """
    for name in arrivals:
        name_index = arrivals.index(name)
        return name != arrivals[-1] and name_index >= len(arrivals)/2
        # if name==arrivals[-1] or name_index <= len(arrivals)/2 ----->other option

In [33]:
fashionably_late(a1, 'Mona')

False

# External libraries

In [37]:
import math as mt

In [35]:
pi

NameError: name 'pi' is not defined

In [41]:
math.pi

NameError: name 'math' is not defined

In [39]:
mt.pi

3.141592653589793

In [45]:
mt.log(32, 2)

5.0

In [43]:
import math
math.pi

3.141592653589793

In [47]:
import random

In [55]:
random.randint(1, 10)

8

In [57]:
import numpy as np
import pandas as pd

# Hello pandas!!
## Hello dataframes!!

A dataframe is made up of series, and unintuitively series and dataframes don't have the same functions

Dataframes are super useful data structure, they're very efficient so easy to do handle large datasets (once they're in a dataframe), flexible, can be created from almost anything, many cool built in functions, and just overall the basic structure of working with data

In [61]:
data = ['apple', 'banana', 'cherry']
pd.DataFrame(data)

        0
0   apple
1  banana
2  cherry

In [63]:
pd.DataFrame(data, columns=['Fruit'])

    Fruit
0   apple
1  banana
2  cherry

In [69]:
data = {'Name': ['Tom', 'Nick', 'Krish', 'Jack'],
        'Age': [20, 21, 19, None]}

pd.DataFrame(data)

    Name   Age
0    Tom  20.0
1   Nick  21.0
2  Krish  19.0
3   Jack   NaN

In [71]:
df = pd.read_excel(r'C:\Users\ydool\Downloads\Data Operations Job Title Taxonomy Versioned.xlsx', sheet_name='master v1')

In [75]:
df.head(4)

,alias,canonical_title,parent_title,title_definition,function,function_ISO-8K-150,is_generic,is_people_manager,is_active,alias_company,alias_time_stamp,comment
0,ai linguist,AI Linguist,Language Data Analyst,NaN,Data Operations Management,Data Administrator,NaN,NaN,yes,NaN,NaT,NaN
1,ai operations manager,AI Operations Manager,Data Operations Manager,NaN,Data Operations Management,Data Manager,NaN,NaN,yes,NaN,NaT,NaN
2,ai project manager,AI Project Manager,AI Operations Manager,NaN,Data Operations Management,Data Manager,NaN,NaN,yes,NaN,NaT,NaN
3,ai solutions specialist,AI Solutions Specialist,NaN,NaN,Data Operations Management,Data Administrator,yes,NaN,yes,Salesforce,NaT,NaN

In [77]:
df.tail()

,alias,canonical_title,parent_title,title_definition,function,function_ISO-8K-150,is_generic,is_people_manager,is_active,alias_company,alias_time_stamp,comment
131,ai specialist,AI Solutions Specialist,NaN,NaN,Data Operations Management,Data Administrator,yes,NaN,yes,NaN,2025-03-29,NaN
132,data engagement team data analyst,Data Engagement Team Data Analyst,Quality Data Analyst,NaN,Data Operations Management,Data Administrator,NaN,NaN,yes,NaN,2025-03-29,NaN
133,data curation manager,Data Curation Manager,Data Operations Manager,NaN,Data Operations Management,Data Manager,NaN,NaN,yes,Cyera,2025-03-29,NaN
134,head of master data,Head of Master Data,Data Operations Manager,NaN,Data Operations Management,Data Manager,NaN,NaN,yes,Tnuva,2025-03-29,NaN
135,data collection qa,Data Collection QA,Data Collection Specialist,NaN,Data Labeling,Data Technician,NaN,NaN,yes,NaN,2025-03-29,NaN

In [79]:
df.shape

(136, 12)

In [81]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 136 entries, 0 to 135
Data columns (total 12 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   alias                136 non-null    object
 1   canonical_title      136 non-null    object
 2   parent_title         83 non-null     object
 3   title_definition     0 non-null      float64
 4   function             125 non-null    object
 5   function_ISO-8K-150  125 non-null    object
 6   is_generic           17 non-null     object
 7   is_people_manager    30 non-null     object
 8   is_active            136 non-null    object
 9   alias_company        20 non-null     object
 10  alias_time_stamp     20 non-null     datetime64[ns]
 11  comment              5 non-null      object
dtypes: datetime64[ns](1), float64(1), object(10)
memory usage: 12.9+ KB

In [83]:
df['rand_number'] = np.random.randint(1, 101, size=len(df))
df['rand_number2'] = np.random.randint(1, 101, size=len(df))

In [85]:
df.head()

,alias,canonical_title,parent_title,title_definition,function,function_ISO-8K-150,is_generic,is_people_manager,is_active,alias_company,alias_time_stamp,comment,rand_number,rand_number2
0,ai linguist,AI Linguist,Language Data Analyst,NaN,Data Operations Management,Data Administrator,NaN,NaN,yes,NaN,NaT,NaN,9,42
1,ai operations manager,AI Operations Manager,Data Operations Manager,NaN,Data Operations Management,Data Manager,NaN,NaN,yes,NaN,NaT,NaN,83,14
2,ai project manager,AI Project Manager,AI Operations Manager,NaN,Data Operations Management,Data Manager,NaN,NaN,yes,NaN,NaT,NaN,44,20
3,ai solutions specialist,AI Solutions Specialist,NaN,NaN,Data Operations Management,Data Administrator,yes,NaN,yes,Salesforce,NaT,NaN,19,63
4,annotated data reviewer,Annotated Data Reviewer,Data Labeler,NaN,Data Labeling,Data Technician,NaN,NaN,yes,NaN,NaT,NaN,27,21

In [87]:
df['rand_number']

0       9
1      83
2      44
3      19
4      27
       ..
131    99
132    40
133    71
134    13
135    91
Name: rand_number, Length: 136, dtype: int32

In [89]:
df['diff'] = df['rand_number'] - df['rand_number2']

In [93]:
df['a'] = 'a'

In [95]:
df.head()

,alias,canonical_title,parent_title,title_definition,function,function_ISO-8K-150,is_generic,is_people_manager,is_active,alias_company,alias_time_stamp,comment,rand_number,rand_number2,diff,a
0,ai linguist,AI Linguist,Language Data Analyst,NaN,Data Operations Management,Data Administrator,NaN,NaN,yes,NaN,NaT,NaN,9,42,-33,a
1,ai operations manager,AI Operations Manager,Data Operations Manager,NaN,Data Operations Management,Data Manager,NaN,NaN,yes,NaN,NaT,NaN,83,14,69,a
2,ai project manager,AI Project Manager,AI Operations Manager,NaN,Data Operations Management,Data Manager,NaN,NaN,yes,NaN,NaT,NaN,44,20,24,a
3,ai solutions specialist,AI Solutions Specialist,NaN,NaN,Data Operations Management,Data Administrator,yes,NaN,yes,Salesforce,NaT,NaN,19,63,-44,a
4,annotated data reviewer,Annotated Data Reviewer,Data Labeler,NaN,Data Labeling,Data Technician,NaN,NaN,yes,NaN,NaT,NaN,27,21,6,a

In [97]:
df.describe()

,title_definition,alias_time_stamp,rand_number,rand_number2,diff
count,0.0,20,136.000000,136.000000,136.000000
mean,NaN,2025-01-08 16:48:00,48.507353,50.360294,-1.852941
min,NaN,2024-08-10 00:00:00,1.000000,1.000000,-89.000000
25%,NaN,2024-11-14 00:00:00,18.750000,25.000000,-32.250000
50%,NaN,2025-02-19 12:00:00,45.500000,51.000000,-4.000000
75%,NaN,2025-03-29 00:00:00,75.000000,76.250000,31.250000
max,NaN,2025-03-29 00:00:00,99.000000,100.000000,95.000000
std,NaN,NaN,30.041205,29.762933,41.980336

In [99]:
df['rand_number'].max()

99

In [101]:
df['rand_number'].mean()

48.50735294117647

In [105]:
df['alias'].min()

'ai analyst'

In [103]:
df['alias']

0                            ai linguist
1                  ai operations manager
2                     ai project manager
3                ai solutions specialist
4                annotated data reviewer
                     ...
131                        ai specialist
132    data engagement team data analyst
133                data curation manager
134                  head of master data
135                   data collection qa
Name: alias, Length: 136, dtype: object